VenkatKS/N108/tm4c123ge6pm_startup_ccs.c
};

//*****************************************************************************
//
// This is the code that gets called when the processor first starts execution
// following a reset event.  Only the absolutely necessary set is performed,
// after which the application supplied entry() routine is called.  Any fancy
// actions (such as making decisions based on the reset cause register, and
// resetting the bits in that register) are left solely in the hands of the
// application.
//
//*****************************************************************************
void
ResetISR(void)
{
    //
    // Jump to the CCS C initialization routine.  This will enable the
    // floating-point unit as well, so that does not need to be done here.
    //
    __asm("    .global _c_int00\n"
          "    b.w     _c_int00");
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a NMI.  This
// simply enters an infinite loop, preserving the system state for examination
// by a debugger.
//
//*****************************************************************************
static void
NmiSR(void)
{
    //
    // Enter an infinite loop.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a fault
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
static void
FaultISR(void)
{
    //
    // Enter an infinite loop.
    //
     while(1)
    {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives an unexpected
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
static void
IntDefaultHandler(void)
{
    //
    // Go into an infinite loop.
    //
    while(1)
    {
    }
}





void SVC_Handler(void){ while(1){}}                // SVCall Handler
void DebugMon_Handler(void){ while(1){}}           // Debug Monitor Handler
void PendSV_Handler(void){ while(1){}}             // PendSV Handler
void SysTick_Handler(void){ while(1){}}            // SysTick Handler
void GPIOPortA_Handler(void){ while(1){}}          // GPIO Port A
void GPIOPortB_Handler(void){ while(1){}}          // GPIO Port B
void GPIOPortC_Handler(void){ while(1){}}          // GPIO Port C
void GPIOPortD_Handler(void){ while(1){}}          // GPIO Port D
void GPIOPortE_Handler(void){ while(1){}}          // GPIO Port E
void UART0_Handler(void){ while(1){}}              // UART0 Rx and Tx
void UART1_Handler(void){ while(1){}}              // UART1 Rx and Tx
void SSI0_Handler(void){ while(1){}}               // SSI0 Rx and Tx
void I2C0_Handler(void){ while(1){}}               // I2C0 Master and Slave
void PWM0Fault_Handler(void){ while(1){}}          // PWM 0 Fault
void PWM0Generator0_Handler(void){ while(1){}}     // PWM 0 Generator 0
void PWM0Generator1_Handler(void){ while(1){}}     // PWM 0 Generator 1
void PWM0Generator2_Handler(void){ while(1){}}     // PWM 0 Generator 2
void Quadrature0_Handler(void){ while(1){}}        // Quadrature Encoder 0
void ADC0Seq0_Handler(void){ while(1){}}           // ADC0 Sequence 0
void ADC0Seq1_Handler(void){ while(1){}}           // ADC0 Sequence 1
void ADC0Seq2_Handler(void){ while(1){}}           // ADC0 Sequence 2
void ADC0Seq3_Handler(void){ while(1){}}           // ADC0 Sequence 3
void WDT_Handler(void){ while(1){}}                // Watchdog
void Timer0A_Handler(void){ while(1){}}            // Timer 0 subtimer A
void Timer0B_Handler(void){ while(1){}}            // Timer 0 subtimer B
void Timer1A_Handler(void){ while(1){}}            // Timer 1 subtimer A
void Timer1B_Handler(void){ while(1){}}            // Timer 1 subtimer B
void Timer2A_Handler(void){ while(1){}}            // Timer 2 subtimer A
void Timer2B_Handler(void){ while(1){}}            // Timer 2 subtimer B
void Comp0_Handler(void){ while(1){}}              // Analog Comp 0
void Comp1_Handler(void){ while(1){}}              // Analog Comp 1
void Comp2_Handler(void){ while(1){}}              // Analog Comp 2
void SysCtl_Handler(void){ while(1){}}             // System Control
void FlashCtl_Handler(void){ while(1){}}           // Flash Control
void GPIOPortF_Handler(void){ while(1){}}          // GPIO Port F
void GPIOPortG_Handler(void){ while(1){}}          // GPIO Port G
void GPIOPortH_Handler(void){ while(1){}}          // GPIO Port H
void UART2_Handler(void){ while(1){}}              // UART2 Rx and Tx
void SSI1_Handler(void){ while(1){}}               // SSI1 Rx and Tx
void Timer3A_Handler(void){ while(1){}}            // Timer 3 subtimer A
void Timer3B_Handler(void){ while(1){}}            // Timer 3 subtimer B
void I2C1_Handler(void){ while(1){}}               // I2C1 Master and Slave
void Quadrature1_Handler(void){ while(1){}}        // Quadrature Encoder 1
void CAN0_Handler(void){ while(1){}}               // CAN0
void CAN1_Handler(void){ while(1){}}               // CAN1
void CAN2_Handler(void){ while(1){}}               // CAN2
void Ethernet_Handler(void){ while(1){}}           // Ethernet
void Hibernate_Handler(void){ while(1){}}          // Hibernate
void USB0_Handler(void){ while(1){}}               // USB0
void PWM0Generator3_Handler(void){ while(1){}}     // PWM 0 Generator 3
void uDMA_Handler(void){ while(1){}}               // uDMA Software Transfer
void uDMA_Error(void){ while(1){}}                 // uDMA Error
void ADC1Seq0_Handler(void){ while(1){}}           // ADC1 Sequence 0
void ADC1Seq1_Handler(void){ while(1){}}           // ADC1 Sequence 1
void ADC1Seq2_Handler(void){ while(1){}}           // ADC1 Sequence 2
void ADC1Seq3_Handler(void){ while(1){}}           // ADC1 Sequence 3
void I2S0_Handler(void){ while(1){}}               // I2S0
void ExtBus_Handler(void){ while(1){}}             // External Bus Interface 0
void GPIOPortJ_Handler(void){ while(1){}}          // GPIO Port J
void GPIOPortK_Handler(void){ while(1){}}          // GPIO Port K
void GPIOPortL_Handler(void){ while(1){}}          // GPIO Port L
void SSI2_Handler(void){ while(1){}}               // SSI2 Rx and Tx
void SSI3_Handler(void){ while(1){}}               // SSI3 Rx and Tx
void UART3_Handler(void){ while(1){}}              // UART3 Rx and Tx
void UART4_Handler(void){ while(1){}}              // UART4 Rx and Tx
void UART5_Handler(void){ while(1){}}              // UART5 Rx and Tx
void UART6_Handler(void){ while(1){}}              // UART6 Rx and Tx
void UART7_Handler(void){ while(1){}}              // UART7 Rx and Tx
void I2C2_Handler(void){ while(1){}}               // I2C2 Master and Slave
void I2C3_Handler(void){ while(1){}}               // I2C3 Master and Slave
void Timer4A_Handler(void){ while(1){}}            // Timer 4 subtimer A
void Timer4B_Handler(void){ while(1){}}            // Timer 4 subtimer B
void Timer5A_Handler(void){ while(1){}}            // Timer 5 subtimer A
void Timer5B_Handler(void){ while(1){}}            // Timer 5 subtimer B
void WideTimer0A_Handler(void){ while(1){}}        // Wide Timer 0 subtimer A
void WideTimer0B_Handler(void){ while(1){}}        // Wide Timer 0 subtimer B
void WideTimer1A_Handler(void){ while(1){}}        // Wide Timer 1 subtimer A
void WideTimer1B_Handler(void){ while(1){}}        // Wide Timer 1 subtimer B
void WideTimer2A_Handler(void){ while(1){}}        // Wide Timer 2 subtimer A
void WideTimer2B_Handler(void){ while(1){}}        // Wide Timer 2 subtimer B
void WideTimer3A_Handler(void){ while(1){}}        // Wide Timer 3 subtimer A
void WideTimer3B_Handler(void){ while(1){}}        // Wide Timer 3 subtimer B
void WideTimer4A_Handler(void){ while(1){}}        // Wide Timer 4 subtimer A
void WideTimer4B_Handler(void){ while(1){}}        // Wide Timer 4 subtimer B
void WideTimer5A_Handler(void){ while(1){}}        // Wide Timer 5 subtimer A
void WideTimer5B_Handler(void){ while(1){}}        // Wide Timer 5 subtimer B
void FPU_Handler(void){ while(1){}}                // FPU
void PECI0_Handler(void){ while(1){}}              // PECI 0
void LPC0_Handler(void){ while(1){}}               // LPC 0
void I2C4_Handler(void){ while(1){}}               // I2C4 Master and Slave
void I2C5_Handler(void){ while(1){}}               // I2C5 Master and Slave
void GPIOPortM_Handler(void){ while(1){}}          // GPIO Port M
void GPIOPortN_Handler(void){ while(1){}}          // GPIO Port N
void Quadrature2_Handler(void){ while(1){}}        // Quadrature Encoder 2
void Fan0_Handler(void){ while(1){}}               // Fan 0
void GPIOPortP_Handler(void){ while(1){}}          // GPIO Port P (Summary or P0)
void GPIOPortP1_Handler(void){ while(1){}}         // GPIO Port P1
void GPIOPortP2_Handler(void){ while(1){}}         // GPIO Port P2
void GPIOPortP3_Handler(void){ while(1){}}         // GPIO Port P3
void GPIOPortP4_Handler(void){ while(1){}}         // GPIO Port P4
void GPIOPortP5_Handler(void){ while(1){}}         // GPIO Port P5
void GPIOPortP6_Handler(void){ while(1){}}         // GPIO Port P6
void GPIOPortP7_Handler(void){ while(1){}}         // GPIO Port P7
void GPIOPortQ_Handler(void){ while(1){}}          // GPIO Port Q (Summary or Q0)
void GPIOPortQ1_Handler(void){ while(1){}}         // GPIO Port Q1
void GPIOPortQ2_Handler(void){ while(1){}}         // GPIO Port Q2
void GPIOPortQ3_Handler(void){ while(1){}}         // GPIO Port Q3
void GPIOPortQ4_Handler(void){ while(1){}}         // GPIO Port Q4
void GPIOPortQ5_Handler(void){ while(1){}}         // GPIO Port Q5
void GPIOPortQ6_Handler(void){ while(1){}}         // GPIO Port Q6
void GPIOPortQ7_Handler(void){ while(1){}}         // GPIO Port Q7
void GPIOPortR_Handler(void){ while(1){}}          // GPIO Port R
void GPIOPortS_Handler(void){ while(1){}}          // GPIO Port S
void PWM1Generator0_Handler(void){ while(1){}}     // PWM 1 Generator 0
void PWM1Generator1_Handler(void){ while(1){}}     // PWM 1 Generator 1
void PWM1Generator2_Handler(void){ while(1){}}     // PWM 1 Generator 2
void PWM1Generator3_Handler(void){ while(1){}}     // PWM 1 Generator 3
void PWM1Fault_Handler(void){ while(1){}}          // PWM 1 Fault

//*********** DisableInterrupts ***************
// disable interrupts
// inputs:  none
// outputs: none
void DisableInterrupts(void){
	__asm ("    CPSID  I\n");
}

//*********** EnableInterrupts ***************
// emable interrupts
// inputs:  none
// outputs: none
void EnableInterrupts(void){
	__asm  ("    CPSIE  I\n");
}
//*********** StartCritical ************************
// make a copy of previous I bit, disable interrupts
// inputs:  none
// outputs: previous I bit
void StartCritical(void){
 __asm  ("    MRS    R0, PRIMASK  ; save old status \n"
         "    CPSID  I         	  ; mask all (except faults)\n");
}

//*********** EndCritical ************************
// using the copy of previous I bit, restore I bit to previous value
// inputs:  previous I bit
// outputs: none
void EndCritical(void){
	__asm  ("    MSR    PRIMASK, R0\n");
}

//*********** WaitForInterrupt ************************
// go to low power mode while waiting for the next interrupt
// inputs:  none
// outputs: none
void WaitForInterrupt(void){
	__asm  ("    WFI\n");
}
